
#+BEGIN_SRC  makefile :noweb no-export :results silent :exports none :tangle makefile
OUT_DIR=./
# Using GNU Make-specific functions here
FILES=$(patsubst Lecc%.org,$(OUT_DIR)/Lecc%.tex,$(wildcard *.org))
PDF-FILES=$(patsubst Lecc%.tex,$(OUT_DIR)/Lecc%.pdf,$(wildcard *.tex))

#.PHONY: all clean install-doc
.PHONY: all install-doc

Lecc01.pdf: %.tex
	latexmk -c $@ 

all: install-doc

#install-doc: $(FILES)  $(PDF-FILES)
install-doc: $(PDF-FILES)

$(OUT_DIR):
	mkdir -v -p $(OUT_DIR)

#%.tex: %.org
#	emacs -q -l ~/Software/scimax/init.el $< --batch -f org-latex-export-to-latex --kill

%.pdf: %.tex
	latexmk -pdf --shell-escape -interaction=batchmode $< 
	latexmk -c

pedeefes: %.pdf

#$(OUT_DIR)/%.tex: %.tex
#	install -v -m 644 -t $(OUT_DIR) $<
#	rm $<
$(OUT_DIR)/%.pdf: %.pdf
	install -v -m 644 -t ./notas $<

#clean:
#	rm *.tex
#+END_SRC



#+BEGIN_SRC sh :results silent
#pdflatex --shell-escape  -interaction=batchmode Lecc01.tex
#pdflatex --shell-escape  -interaction=batchmode Lecc01.tex
#latexmk -c Lecc01.tex

#pdflatex --shell-escape  -interaction=batchmode Lecc02.tex
#pdflatex --shell-escape  -interaction=batchmode Lecc02.tex
#latexmk -c Lecc02.tex

#pdflatex --shell-escape  -interaction=batchmode Lecc03.tex
#pdflatex --shell-escape  -interaction=batchmode Lecc03.tex
#latexmk -c Lecc03.tex

#pdflatex --shell-escape  -interaction=batchmode Lecc04.tex
#pdflatex --shell-escape  -interaction=batchmode Lecc04.tex
#latexmk -c Lecc04.tex

#pdflatex --shell-escape  -interaction=batchmode Lecc05.tex
#pdflatex --shell-escape  -interaction=batchmode Lecc05.tex
#latexmk -c Lecc05.tex

#pdflatex --shell-escape  -interaction=batchmode Lecc06.tex
#pdflatex --shell-escape  -interaction=batchmode Lecc06.tex
#latexmk -c Lecc06.tex

#pdflatex --shell-escape  -interaction=batchmode Lecc07.tex
#pdflatex --shell-escape  -interaction=batchmode Lecc07.tex
#latexmk -c Lecc07.tex

#pdflatex --shell-escape  -interaction=batchmode Lecc08.tex
* slides para GitHubpages


[[https://nbconvert.readthedocs.io/en/latest/config_options.html][Configuraci贸n para nbconvert]] (las slides usan ficheros de la web para poder funcionar en GitHubPages)

[[https://dbafromthecold.com/2021/02/21/creating-presentations-with-reveal-and-github-pages/][creating-presentations-with-reveal-and-github-pages]]

https://github.com/RichardAfolabi/Presentation_js

https://emasuriano.com/til/2024-07-01-create-presentations-from-notebook/

https://github.com/yjwen/org-reveal
https://github.com/hexmode/ox-reveal

#+BEGIN_SRC python :tangle mycfg-GitHubPages.py
c = get_config()
c.NbConvertApp.notebooks = ["Lecc01.ipynb",
                            "Lecc02.ipynb",
                            "Lecc03.ipynb",
                            "Lecc04.ipynb",
                            "Lecc05.ipynb",
                            "Lecc06.ipynb"]

c.SlidesExporter.reveal_theme = 'solarized'
c.SlidesExporter.reveal_scroll = True
c.SlidesExporter.language_code = 'es'

c.SlidesExporter.mathjax_url = "https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_HTML"

c.SlidesExporter.jquery_url = "https://cdnjs.cloudflare.com/ajax/libs/jquery/2.0.3/jquery.min.js"

c.SlidesExporter.require_js_url = "https://cdnjs.cloudflare.com/ajax/libs/require.js/2.1.10/require.min.js"
#+END_SRC

#+BEGIN_SRC sh :results silent
jupyter nbconvert --config mycfg-GitHubPages.py --to slides --reveal-prefix reveal.js --no-input
#+END_SRC


#+BEGIN_SRC emacs-lisp
(require 'ox-ipynb)
(ox-ipynb-export-org-file-to-ipynb-file "Lecc01.org")
(ox-ipynb-export-org-file-to-ipynb-file "Lecc02.org")
;(ox-ipynb-export-org-file-to-ipynb-file "Lecc03.org")
;(ox-ipynb-export-org-file-to-ipynb-file "Lecc04.org")
;(ox-ipynb-export-org-file-to-ipynb-file "Lecc05.org")
#+END_SRC

#+RESULTS:
: Lecc01.ipynb


# jupyter nbconvert --config mycfg.py
# jupyter nbconvert --config mycfg.py  --to slides --reveal-prefix reveal.js
# jupyter nbconvert --config mycfg.py  --to slides --offline embed --reveal-prefix reveal.js
